# AvailableViews Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewSheetSetting..::..AvailableViews Property
ViewSheetSetting Class See Also
---
All views that can be printed.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ViewSet AvailableViews { get; }
```

Visual Basic
---
```text
Public ReadOnly Property AvailableViews As ViewSet
	Get
```

Visual C++
---
```text
public:
property ViewSet^ AvailableViews {
	ViewSet^ get ();
}
```

# Remarks
Users can select the view/sheet from this view set to printing.
# See Also
ViewSheetSetting Class
Autodesk.Revit.DB Namespace